/*
Напишите программу, которая принимает не вход трехначное число и на выходе показывакет вторубю цифру этого числа.
*/
Console.WriteLine("Задание №1");
Console.WriteLine("Напишите программу, которая принимает на вход трехначное число и на выходе показывакет вторубю цифру этого числа.");
/*
int[] arrey = Console.ReadLine("Введем трехзначное число ==> "());
int n = arrey.Length;
Console.WriteLine(n);
*/
int numb = Convert.ToInt32(Console.ReadLine());
int[] arrey = {numb};
int gg = arrey.Length;
Console.WriteLine(gg);



